# language: ru
@alphabeths @controller
@wip
Свойство: Правач азбук
   Предыстория:
      * є азбука сѫ даными:
         | id           | 200001 |
         | code         | rus    |
         | meta         | {}     |
      * є користник сѫ прѣзвищем 'user' и токеном

   @json @create
   Пример: Користник створяє азбукъ
      Если є створение азбуке сѫ даными:
         | id           | 200002             |
         | code         | csl                |
         | meta         | {data: "1"}        |
      И послѣдня изнаходь азбуке бѫдє яко:
         """
         ---
         id: 200002
         code: csl
         meta: {data: "1"}
         """

   @json @update
   Пример: Користник поновяє дане азбуке
      Если запытам одсланје азбуке во изнаходь "/a/200001.json" сѫ даными:
         | code            | chu          |
         | meta            | {}           |
      То добѫдѫ кодъ поврата "200"
      Если запытам добыванје из изнаходи "/a/200001.json"
      То добѫдѫ кодъ поврата "200"
      И добѫдѫ вывод:
         """
         ---
         id: 200001
         code: chu
         meta: {}
         """

   @json @get
   Пример: Користник добыває дане азбуке
      Если запытам добыванје из изнаходи "/a/200001.json"
      То добѫдѫ вывод:
         """
         ---
         id: 200001
         code: rus
         meta: {}
         """

   @json @index
   Пример: Користник добыває списъ азбук
      Если запытам добыванје из изнаходи "/a.json"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 200001
            code: rus
            meta: {}
         total: 1
         """

   @json @delete
   Пример: Користник изтьрає иззначене азбуке
      Если запытам изтрѣнје изнаходи "/a/200001.json"
      То добѫдѫ кодъ поврата "200"
      И азбука сѫ озом "200001" не будє єствовати
