# language: ru
@attitude @controller
@wip
Свойство: Правач одношенјев
   Предыстория:
      * є значение сѫ даными:
         | id           | 200001    |
         | tag_ids      | [2]       |
         | article_ids  | [1]       |
      * є значение сѫ даными:
         | id           | 200002    |
         | tag_ids      | [1]       |
         | article_ids  | [2]       |
      * є одношение сѫ даными:
         | id           | 200001    |
         | left_id      | 200001    |
         | right_id     | 200002    |
         | kind         | synonim   |
      * є користник сѫ прѣзвищем 'user' и токеном

   @json @create
   Пример: Користник створяє одношенје
      Если є створение одношенја сѫ даными:
         | id           | 200002    |
         | left_id      | 200001    |
         | right_id     | 200002    |
         | kind         | antonim   |
      И послѣдня изнаходь одношенја бѫдє яко:
         """
         ---
         id: 200002
         left_id: 200001
         right_id: 200002
         kind: antonim
         """

   @json @update
   Пример: Користник поновяє дане одношенја
      Если запытам одсланје одношенја во изнаходь "/at/200001.json" сѫ даными:
         | left_id      | 200002    |
         | right_id     | 200001    |
         | kind         | antonim   |
      То добѫдѫ кодъ поврата "200"
      Если запытам добыванје из изнаходи "/at/200001.json"
      То добѫдѫ кодъ поврата "200"
      И добѫдѫ вывод:
         """
         ---
         id: 200001
         left_id: 200002
         right_id: 200001
         kind: antonim
         """

   @json @get
   Пример: Користник добыває дане одношенја
      Если запытам добыванје из изнаходи "/at/200001.json"
      То добѫдѫ вывод:
         """
         ---
         id: 200001
         left_id: 200001
         right_id: 200002
         kind: synonim
         """

   @json @index
   Пример: Користник добыває списъ одношенјев
      Если запытам добыванје из изнаходи "/at.json"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 200001
            left_id: 200001
            right_id: 200002
            kind: synonim
         total: 1
         """

   @json @delete
   Пример: Користник изтьрає иззначене одношенја
      Если запытам изтрѣнје изнаходи "/at/200001.json"
      То добѫдѫ кодъ поврата "200"
      И одношение сѫ озом "200001" не будє єствовати
