# language: ru
@languages @controller
@wip
Свойство: Правач словников
   Предыстория:
      * є словник сѫ даными:
         | id           | 200001                |
         | uri          | https://glosbe.com/en |
         | meta         | {}                    |
      * є користник сѫ прѣзвищем 'user' и токеном

   @json @create
   Пример: Користник створяє словникъ
      Если є створение словника сѫ даными:
         | id           | 200002                |
         | uri          | https://glosbe.com/ru |
         | meta         | {data: "1"}           |
      И послѣдня изнаходь словника бѫдє яко:
         """
         ---
         id: 200002
         uri: https://glosbe.com/ru
         meta: {data: "1"}
         """

   @json @update
   Пример: Користник поновяє дане словника
      Если запытам одсланје словника во изнаходь "/d/200001.json" сѫ даными:
         | uri             | https://glosbe.com/ru |
         | meta            | {}                    |
      То добѫдѫ кодъ поврата "200"
      Если запытам добыванје из изнаходи "/d/200001.json"
      То добѫдѫ кодъ поврата "200"
      И добѫдѫ вывод:
         """
         ---
         id: 200001
         uri: https://glosbe.com/ru
         meta: {}
         """

   @json @get
   Пример: Користник добыває дане словника
      Если запытам добыванје из изнаходи "/d/200001.json"
      То добѫдѫ вывод:
         """
         ---
         id: 200001
         uri: https://glosbe.com/en
         meta: {}
         """

   @json @index
   Пример: Користник добыває списъ словников
      Если запытам добыванје из изнаходи "/d.json"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 200001
            uri: https://glosbe.com/en
            meta: {}
         total: 1
         """

   @json @delete
   Пример: Користник изтьрає иззначене словника
      Если запытам изтрѣнје изнаходи "/d/200001.json"
      То добѫдѫ кодъ поврата "200"
      И словник сѫ озом "200001" не будє єствовати
