# language: ru
@languages @controller
@wip
Свойство: Правач ѧзыков
   Предыстория:
      * є ѧзык сѫ даными:
         | id           | 200001 |
         | code         | rus    |
         | meta         | {}     |
      * є користник сѫ прѣзвищем 'user' и токеном

   @json @create
   Пример: Користник створяє ѧзыкъ
      Если є створение ѧзыка сѫ даными:
         | id           | 200002             |
         | code         | csl                |
         | meta         | {data: "1"}        |
      И послѣдня изнаходь ѧзыка бѫдє яко:
         """
         ---
         id: 200002
         code: csl
         meta: {data: "1"}
         """

   @json @update
   Пример: Користник поновяє дане ѧзыка
      Если запытам одсланје ѧзыка во изнаходь "/l/200001.json" сѫ даными:
         | code            | chu          |
         | meta            | {}           |
      То добѫдѫ кодъ поврата "200"
      Если запытам добыванје из изнаходи "/l/200001.json"
      То добѫдѫ кодъ поврата "200"
      И добѫдѫ вывод:
         """
         ---
         id: 200001
         code: chu
         meta: {}
         """

   @json @get
   Пример: Користник добыває дане ѧзыка
      Если запытам добыванје из изнаходи "/l/200001.json"
      То добѫдѫ вывод:
         """
         ---
         id: 200001
         code: rus
         meta: {}
         """

   @json @index
   Пример: Користник добыває списъ ѧзыков
      Если запытам добыванје из изнаходи "/l.json"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 200001
            code: rus
            meta: {}
            short:
          - meta: {}
            short:
          - meta: {}
            short:
          - meta: {}
            short:
         total: 4
         """

   @json @delete
   Пример: Користник изтьрає иззначене ѧзыка
      Если запытам изтрѣнје изнаходи "/l/200001.json"
      То добѫдѫ кодъ поврата "200"
      И ѧзык сѫ озом "200001" не будє єствовати
