# language: ru
@libra @controller
@wip
Свойство: Правач бук
   Предыстория:
      * є користник сѫ токеном и даными:
         | id        | 10000              |
         | email     | mylo@koristnika.ru |
         | password  | 1234567890         |
      * є новина
      * є буко сѫ даными:
         | id        | 100000             |
         | title     | Текст 1            |
         | text      | Текстовая строка   |

   @json @create
   Пример: Користник створяє бука
      Допустим користник є правчиком
      Если є створенје бука сѫ даными:
         | author_id | 10000              |
         | title     | Текст 3            |
         | text      | Текстовая строка 3 |
      То добѫдѫ кодъ поврата "200"
      И послѣдня изнаходь бука бѫдє яко:
         """
         ---
         title: Текст 3
         text: Текстовая строка 3
         """

   @json @update
   Пример: Користник поновяє дане
      Допустим користник є правчиком
      Если запытам одсланје бука во изнаходь "/library/100000.json" сѫ даными:
         | title  | Текст 2            |
         | text   | Текстовая строка 2 |
      То добѫдѫ кодъ поврата "200"
      И запытам добыванје из изнаходи "/library/100000.json"
      То добѫдѫ кодъ поврата "200"
      И добѫдѫ вывод:
         """
         ---
         id: 100000
         title: Текст 2
         text: Текстовая строка 2
         """

   @json @get
   Пример: Користник добыває дане бука
      Если запытам добыванје из изнаходи "/library/100000.json"
      То добѫдѫ вывод:
         """
         ---
         id: 100000
         title: Текст 1
         text: Текстовая строка
         """

   @json @index
   Пример: Користник добыває списъ даных
      Если запытам добыванје из изнаходи "/library.json"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 100000
            title: Текст 1
            text: Текстовая строка
         total: 1
         """

   @json @delete
   Пример: Користник изтьрає иззначене буке
      Допустим користник є правчиком
      Если запытам добыванје из изнаходи "/library.json"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 100000
            title: Текст 1
            text: Текстовая строка
         total: 1
         """
      Если запытам изтрѣнје изнаходи "/library/100000.json"
      То добѫдѫ кодъ поврата "200"
      И бука сѫ озом "100000" не будє єствовати
      Если запытам добыванје из изнаходи "/library.json"
      То добѫдѫ вывод:
         """
         ---
         list: []
         total: 0
         """

   @json @create
   Пример: Користник кушає створити бука
      Если є створенје бука сѫ даными:
         | id        | 200001             |
         | author_id | 10000              |
         | title     | Текст 3            |
         | text      | Текстовая строка 3 |
      То добѫдѫ кодъ поврата "403"
      И бука сѫ озом "200001" не будє єствовати

   @json @update
   Пример: Користник кушає поновити дане
      Если запытам одсланје бука во изнаходь "/library/100000.json" сѫ даными:
         | title  | Текст 2            |
         | text   | Текстовая строка 2 |
      То добѫдѫ кодъ поврата "403"
      И запытам добыванје из изнаходи "/library/100000.json"
      То добѫдѫ кодъ поврата "200"
      И послѣдня изнаходь бука бѫдє яко:
         """
         ---
         id: 100000
         author_id: 10000
         title: Текст 1
         text: Текстовая строка
         """

   @json @delete
   Пример: Користник кушає изтьрѣти иззначена бука
      Если запытам изтрѣнје изнаходи "/library/100000.json"
      То добѫдѫ кодъ поврата "403"
      И послѣдня изнаходь бука бѫдє яко:
         """
         ---
         id: 100000
         author_id: 10000
         title: Текст 1
         text: Текстовая строка
         """
