# language: ru
@libra @controller
@wip
Свойство: Правач бук
   Предыстория:
      * є буко сѫ даными:
         | id        | 100000             |
         | title     | Текст 1            |
         | text      | Текстовая строка   |
      * є користник сѫ прѣзвищем "user" и токеном
      * єсм приявєным

   Пример: Користник углѧдає списъ бук
      Пусть є буко сѫ даными:
         | title     | Текст 2      |
         | text      | Тесто сто    |
      Если посєчям странку "/library"
      То добѫдѫ кодъ поврата "200"
      И углѧдаѫ бука:
         """
         Текст 1
         Текстовая строка
         Текст 2
         Тесто сто
         """

   Пример: Користник углѧдає иззначене буке
      Если посєчям странку "/library/100000"
      То добѫдѫ кодъ поврата "200"
      И углѧдаѫ бука:
         """
         Текст 1
         Текстовая строка
         """

   Пример: Користник прави иззначене буке
      Если посєчям странку "/library/100000/edit"
      То добѫдѫ кодъ поврата "200"
      И углѧдаѫ бука:
         """
         Текст 1
         Текстовая строка
         """
      Если правим свою назву яко "Текст 2"
      И правим своє дане яко "Текстовая строка 2"
      И запишем форму правке
      То добѫдѫ кодъ поврата "200"
      И правке сѫчасна бука будꙛ єствовати яко:
         | title  | Текст 2            |
         | text   | Текстовая строка 2 |

   Пример: Користник изтьрає иззначене буке
      Если кушам изтрѣти странку "/library/100000"
      То добѫдѫ кодъ поврата "200"
      И бука сѫ озом "100000" не будє єствовати

   @json
   Пример: Користник створяє бука
      Если сꙛ правке сѫчасна бука сѫ даными:
         | title  | Текст 3            |
         | text   | Текстовая строка 3 |
      И запытам добыванје послѣднеи изнаходи
      То добѫдѫ вывод:
         """
         ---
         title: Текст 3
         text: Текстовая строка 3
         """

   @json
   Пример: Користник поновяє дане
      Если сꙛ правке сѫчасна бука сѫ даными:
         | title  | Текст 2            |
         | text   | Текстовая строка 2 |
      И запытам добыванје из изнаходи "/library/100000.json"
      То добѫдѫ вывод:
         """
         ---
         id: 100000
         title: Текст 2
         text: Текстовая строка 2
         """

   @json
   Пример: Користник добыває дане бука
      Если запытам добыванје из изнаходи "/library/100000.json"
      То добѫдѫ вывод:
         """
         ---
         id: 100000
         title: Текст 1
         text: Текстовая строка
         """

   @json
   Пример: Користник добыває списъ даных
      Если запытам добыванје из изнаходи "/library.json"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 100000
            title: Текст 1
            text: Текстовая строка
         total: 1
         """

   @json
   Пример: Користник изтьрає иззначене буке
      Если запытам изтрѣнје изнаходи "/library/100000.json"
      То добѫдѫ кодъ поврата "200"
      И бука сѫ озом "100000" не будє єствовати
