# language: ru
@novelties @controller
@wip
Свойство: Правач новин
   Предыстория:
      * є користник сѫ токеном и даными:
         | id        | 10000              |
         | email     | mylo@koristnika.ru |
         | password  | 1234567890         |
      * є ѧзык сѫ даными:
         | id           | 200001 |
         | code         | rus    |
         | meta         | {}     |
      * є азбука сѫ даными:
         | id           | 200001 |
         | code         | rus    |
         | meta         | {}     |
      * є мѣта сѫ даными:
         | id           | 200001    |
         | kind         | article   |
         | title        | tag1      |
      * є буко
      * є новина сѫ даными:
         | id        | 100001             |
         | title     | Текст 1            |
         | text      | Текстовая строка   |

   @json @create
   Пример: Правчик створяє новину
      Допустим користник є правчиком
      Если є створенје новине сѫ даными:
         | author_id | 10000              |
         | title     | Текст 3            |
         | text      | Текстовая строка 3 |
         | abstract  | Текстовая 3        |
         | cover_uri | https://uri.ru/uri |
         | tags      | [tag1]             |
      То добѫдѫ кодъ поврата "200"
      И послѣдня изнаходь новине бѫдє яко:
         """
         ---
         title: Текст 3
         text: Текстовая строка 3
         abstract: Текстовая 3
         cover_uri: https://uri.ru/uri
         tag_ids: [200001]
         """

   @json @update
   Пример: Правчик поновяє дане
      Допустим користник є правчиком
      Если запытам одсланје новине во изнаходь "/news/100001.json" сѫ даными:
         | title  | Текст 2            |
         | text   | Текстовая строка 2 |
      То добѫдѫ кодъ поврата "200"
      И запытам добыванје из изнаходи "/news/100001.json"
      То добѫдѫ кодъ поврата "200"
      И добѫдѫ вывод:
         """
         ---
         id: 100001
         title: Текст 2
         text: Текстовая строка 2
         """

   @json @get
   Пример: Користник добыває дане новину
      Если запытам добыванје из изнаходи "/news/100001.json"
      То добѫдѫ вывод:
         """
         ---
         id: 100001
         title: Текст 1
         text: Текстовая строка
         """

   @json @index
   Пример: Користник добыває списъ даных
      Если запытам добыванје из изнаходи "/news.json"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 100001
            title: Текст 1
            text: Текстовая строка
         total: 1
         """

   @json @index
   Пример: Користник добыває списъ даных
      Допустим є новина сѫ даными:
         | id        | 100002             |
         | title     | Текст 2            |
         | text      | Текстовая строка 2 |
      Если запытам добыванје из изнаходи "/news.json?sort=created_at:desc,id"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 100002
            title: Текст 2
            text: Текстовая строка 2
          - id: 100001
            title: Текст 1
            text: Текстовая строка
         total: 2
         """

   @json @delete
   Пример: Правчик изтьрає иззначену новину
      Допустим користник є правчиком
      Если запытам добыванје из изнаходи "/news.json"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 100001
            title: Текст 1
            text: Текстовая строка
         total: 1
         """
      Если запытам изтрѣнје изнаходи "/news/100001.json"
      То добѫдѫ кодъ поврата "200"
      И новина сѫ озом "100001" не будє єствовати
      Если запытам добыванје из изнаходи "/news.json"
      То добѫдѫ вывод:
         """
         ---
         list: []
         total: 0
         """

   @json @delete
   Пример: Правчик кушає изтьрѣти неєствуꙛчу новину
      Допустим користник є правчиком
      Если запытам изтрѣнје изнаходи "/news/987654.json"
      То добѫдѫ кодъ поврата "423"

   @json @index
   Пример: Користник добыває списъ даных постраничнѣ
      Допустим є новина сѫ даными:
         | id        | 100002             |
         | title     | Текст 2            |
         | text      | Текстовая строка 2 |
      Если запытам добыванје из изнаходи "/news.json?p=1&per=1"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 100001
            title: Текст 1
            text: Текстовая строка
         page: 1
         per: 1
         total: 2
         """

      Если запытам добыванје из изнаходи "/news.json?p=2&per=1"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 100002
            title: Текст 2
            text: Текстовая строка 2
         page: 2
         per: 1
         total: 2
         """

   @json @index @tags
   Пример: Користник добыває списъ даных по мѣтам
      Допустим є мѣта сѫ даными:
         | id           | 200002    |
         | kind         | librum    |
         | title        | tag2      |
      И є новина сѫ даными:
         | id        | 100002             |
         | title     | Текст 2            |
         | text      | Текстовая строка 2 |
         | tags      | [tag1,tag2]        |
      Если запытам добыванје из изнаходи "/news.json?by_tags[]=tag1&by_tags[]=tag2"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 100002
            title: Текст 2
            text: Текстовая строка 2
            tag_ids: [200001,200002]
         page: 1
         per: 25
         total: 1
         """

   @json @index @tags @negation
   Пример: Користник добыває списъ даных не по мѣтам
      Допустим є мѣта сѫ даными:
         | id           | 200002    |
         | kind         | librum    |
         | title        | tag2      |
      И є новина сѫ даными:
         | id        | 100002             |
         | title     | Текст 2            |
         | text      | Текстовая строка 2 |
         | tags      | [tag1]             |
      Если запытам добыванје из изнаходи "/news.json?by_tags[]=!tag1"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 100001
            title: Текст 1
            text: Текстовая строка
            tag_ids: []
         page: 1
         per: 25
         total: 1
         """

   @json @create
   Пример: Користник кушає створити новину
      Если є створенје новине сѫ даными:
         | id        | 200001             |
         | author_id | 10000              |
         | title     | Текст 3            |
         | text      | Текстовая строка 3 |
      То добѫдѫ кодъ поврата "403"
      И новина сѫ озом "200001" не будє єствовати

   @json @update
   Пример: Користник кушає поновити дане
      Если запытам одсланје новине во изнаходь "/news/100001.json" сѫ даными:
         | title  | Текст 2            |
         | text   | Текстовая строка 2 |
      То добѫдѫ кодъ поврата "403"
      И запытам добыванје из изнаходи "/news/100001.json"
      То добѫдѫ кодъ поврата "200"
      И послѣдня изнаходь новине бѫдє яко:
         """
         ---
         id: 100001
         author_id: 10000
         title: Текст 1
         text: Текстовая строка
         """

   @json @delete
   Пример: Користник кушає изтьрѣти иззначену новину
      Если запытам изтрѣнје изнаходи "/news/100001.json"
      То добѫдѫ кодъ поврата "403"
      И послѣдня изнаходь новине бѫдє яко:
         """
         ---
         id: 100001
         author_id: 10000
         title: Текст 1
         text: Текстовая строка
         """
