# language: ru
@novelties @controller
@wip
Свойство: Правач новин
   Предыстория:
      * є користник сѫ токеном и даными:
         | id        | 10000              |
         | email     | mylo@koristnika.ru |
         | password  | 1234567890         |
      * є буко
      * є новина сѫ даными:
         | id        | 100001             |
         | title     | Текст 1            |
         | text      | Текстовая строка   |

   @json
   Пример: Користник створяє новину
      Если є створенје новине сѫ даными:
         | author_id | 10000              |
         | title     | Текст 3            |
         | text      | Текстовая строка 3 |
      И послѣдня изнаходь новине бѫдє яко:
         """
         ---
         title: Текст 3
         text: Текстовая строка 3
         """

   @json
   Пример: Користник поновяє дане
      Если сꙛ правке сѫчасне новине сѫ даными:
         | title  | Текст 2            |
         | text   | Текстовая строка 2 |
      И запытам добыванје из изнаходи "/news/100001.json"
      То добѫдѫ вывод:
         """
         ---
         id: 100001
         title: Текст 2
         text: Текстовая строка 2
         """

   @json
   Пример: Користник добыває дане новину
      Если запытам добыванје из изнаходи "/news/100001.json"
      То добѫдѫ вывод:
         """
         ---
         id: 100001
         title: Текст 1
         text: Текстовая строка
         """

   @json
   Пример: Користник добыває списъ даных
      Если запытам добыванје из изнаходи "/news.json"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 100001
            title: Текст 1
            text: Текстовая строка
         total: 1
         """

   @json
   Пример: Користник добыває списъ даных
      Допустим є новина сѫ даными:
         | id        | 100002             |
         | title     | Текст 2            |
         | text      | Текстовая строка 2 |
      Если запытам добыванје из изнаходи "/news.json?sort=created_at:desc,id"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 100002
            title: Текст 2
            text: Текстовая строка 2
          - id: 100001
            title: Текст 1
            text: Текстовая строка
         total: 2
         """

   @json
   Пример: Користник изтьрає иззначену новину
      Если запытам добыванје из изнаходи "/news.json"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 100001
            title: Текст 1
            text: Текстовая строка
         total: 1
         """
      Если запытам изтрѣнје изнаходи "/news/100001.json"
      То добѫдѫ кодъ поврата "200"
      И новина сѫ озом "100001" не будє єствовати
      Если запытам добыванје из изнаходи "/news.json"
      То добѫдѫ вывод:
         """
         ---
         list: []
         total: 0
         """

   @json
   Пример: Користник изтьрає неєствуꙛчу новину
      Если запытам изтрѣнје изнаходи "/news/987654.json"
      То добѫдѫ кодъ поврата "423"

   @json
   Пример: Користник добыває списъ даных постраничнѣ
      Допустим є новина сѫ даными:
         | id        | 100002             |
         | title     | Текст 2            |
         | text      | Текстовая строка 2 |
      Если запытам добыванје из изнаходи "/news.json?p=1&per=1"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 100001
            title: Текст 1
            text: Текстовая строка
         page: 1
         per: 1
         total: 2
         """

      Если запытам добыванје из изнаходи "/news.json?p=2&per=1"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 100002
            title: Текст 2
            text: Текстовая строка 2
         page: 2
         per: 1
         total: 2
         """
