# language: ru
@piece @controller
@wip
Свойство: Правач дєлов
   Предыстория:
      * є дєл сѫ даными:
         | id           | 200001 |
         | language_ids | []     |
         | text         | Text   |
         | meta         | {}     |
      * є користник сѫ прѣзвищем 'user' и токеном

   @json @create
   Пример: Користник створяє дєлъ
      Если є створение дєла сѫ даными:
         | id           | 200002       |
         | language_ids | []           |
         | text         | Text         |
         | meta         | {data: "1"}  |
      И послѣдня изнаходь дєла бѫдє яко:
         """
         ---
         id: 200002
         language_ids: []
         text: Text
         meta: {data: "1"}
         """

   @json @update
   Пример: Користник поновяє дане дєл
      Если запытам одсланје дєла во изнаходь "/p/200001.json" сѫ даными:
         | language_ids | [1]          |
         | text         | Text1        |
         | meta         | {data: "1"}  |
      То добѫдѫ кодъ поврата "200"
      Если запытам добыванје из изнаходи "/p/200001.json"
      То добѫдѫ кодъ поврата "200"
      И добѫдѫ вывод:
         """
         ---
         id: 200001
         language_ids: [1]
         text: Text1
         meta: {data: "1"}
         """

   @json @get
   Пример: Користник добыває дане дєла
      Если запытам добыванје из изнаходи "/p/200001.json"
      То добѫдѫ вывод:
         """
         ---
         id: 200001
         language_ids: []
         text: Text
         meta: {}
         """

   @json @index
   Пример: Користник добыває списъ дєлов
      Если запытам добыванје из изнаходи "/p.json"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 200001
            language_ids: []
            text: Text
            meta: {}
         total: 1
         """

   @json @delete
   Пример: Користник изтьрає иззначене дєла
      Если запытам изтрѣнје изнаходи "/p/200001.json"
      То добѫдѫ кодъ поврата "200"
      И дєл сѫ озом "200001" не будє єствовати
