# language: ru
@social @controller
@wip
Свойство: Правач социалок
   Предыстория:
      * є социалка сѫ даными:
         | id           | 200001       |
         | uri          | email://loc  |
         | kind         | email        |
         | meta         | {}           |
      * є користник сѫ прѣзвищем 'user' и токеном

   @json @create
   Пример: Користник створяє социалку
      Если є створение социалке сѫ даными:
         | id           | 200002             |
         | uri          | https://vk.com     |
         | kind         | vk                 |
         | meta         | {data: "1"}        |
      И послѣдня изнаходь социалке бѫдє яко:
         """
         ---
         id: 200002
         uri: https://vk.com
         kind: vk
         meta: {data: "1"}
         """

   @json @update
   Пример: Користник поновяє дане социалке
      Если запытам одсланје социалке во изнаходь "/so/200001.json" сѫ даными:
         | uri          | https://vk.com  |
         | kind         | vk              |
         | meta         | {data: "1"}     |
      То добѫдѫ кодъ поврата "200"
      Если запытам добыванје из изнаходи "/so/200001.json"
      То добѫдѫ кодъ поврата "200"
      И добѫдѫ вывод:
         """
         ---
         id: 200001
         uri: https://vk.com
         kind: vk
         meta: {data: "1"}
         """

   @json @get
   Пример: Користник добыває дане социалке
      Если запытам добыванје из изнаходи "/so/200001.json"
      То добѫдѫ вывод:
         """
         ---
         id: 200001
         uri: email://loc
         kind: email
         meta: {}
         """

   @json @index
   Пример: Користник добыває списъ социалок
      Если запытам добыванје из изнаходи "/so.json"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 200001
            uri: email://loc
            kind: email
            meta: {}
         total: 1
         """

   @json @delete
   Пример: Користник изтьрає иззначене социалке
      Допустим є социалка сѫ даными:
         | id           | 200002          |
         | uri          | https://vk.com  |
         | kind         | vk              |
         | meta         | {}              |
      Если запытам изтрѣнје изнаходи "/so/200002.json"
      То добѫдѫ кодъ поврата "200"
      И социалка сѫ озом "200002" не будє єствовати
