# language: ru
@tag @controller
@wip
Свойство: Правач мѣт
   Предыстория:
      * є мѣта сѫ даными:
         | id           | 200001    |
         | kind         | article   |
      * є користник сѫ прѣзвищем 'user' и токеном

   @json @create
   Пример: Користник створяє мѣтъ
      Если є створение мѣте сѫ даными:
         | id           | 200002             |
         | kind         | language           |
      И послѣдня изнаходь мѣте бѫдє яко:
         """
         ---
         id: 200002
         kind: language
         """

   @json @update
   Пример: Користник поновяє дане мѣте
      Если запытам одсланје мѣте во изнаходь "/t/200001.json" сѫ даными:
         | kind            | meaning   |
      То добѫдѫ кодъ поврата "200"
      Если запытам добыванје из изнаходи "/t/200001.json"
      То добѫдѫ кодъ поврата "200"
      И добѫдѫ вывод:
         """
         ---
         id: 200001
         kind: meaning
         """

   @json @get
   Пример: Користник добыває дане мѣте
      Если запытам добыванје из изнаходи "/t/200001.json"
      То добѫдѫ вывод:
         """
         ---
         id: 200001
         kind: article
         """

   @json @index
   Пример: Користник добыває списъ мѣт
      Если запытам добыванје из изнаходи "/t.json"
      То добѫдѫ вывод:
         """
         ---
         list:
          - id: 200001
            kind: article
         total: 1
         """

   @json @delete
   Пример: Користник изтьрає иззначене мѣте
      Если запытам изтрѣнје изнаходи "/t/200001.json"
      То добѫдѫ кодъ поврата "200"
      И мѣта сѫ озом "200001" не будє єствовати
